---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSizeSet.Contains(Autodesk.Revit.DB.Electrical.WireSize)
source: html/4bc92456-6080-6dd3-de41-2bc77165fb23.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.Contains Method

Tests for the existence of a wire size within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	WireSize item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireSize`) - The wire size to be searched for.

## Returns
The Contains method returns True if the wire size is within the set, otherwise False.